The minimum skylight width is 8 inches.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MinSkylightWidthImperial { get; }
  Visual Basic
Public Shared ReadOnly Property MinSkylightWidthImperial As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MinSkylightWidthImperial {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MassFailures Class
  Autodesk.Revit.DB Namespace